{"AAPL": "Apple Inc. designs, manufactures and markets mobile communication and media devices, personal computers and portable digital music players. The Company sells a range of related software, services, accessories, networking solutions, and third-party digital content and applications. The Company's segments include the Americas, Europe, Greater China, Japan and Rest of Asia Pacific. The Americas segment includes both North and South America. The Europe segment includes European countries, India, the Middle East and Africa. The Greater China segment includes China, Hong Kong and Taiwan. The Rest of Asia Pacific segment includes Australia and the Asian countries not included in the Company's other operating segments. Its products and services include iPhone, iPad, Mac, iPod, Apple Watch, Apple TV, a portfolio of consumer and professional software applications, iPhone OS (iOS), OS X and watchOS operating systems, iCloud, Apple Pay and a range of accessory, service and support offerings.", "AMZN": "Amazon.com, Inc. offers a range of products and services through its Websites. The Company's products include merchandise and content that it purchases for resale from vendors and those offered by third-party sellers. It also manufactures and sells electronic devices. It operates through three segments: North America, International and Amazon Web Services (AWS). Its AWS products include analytics, Amazon Athena, Amazon CloudSearch, Amazon EMR, Amazon Elasticsearch Service, Amazon Kinesis, Amazon Managed Streaming for Apache Kafka, Amazon Redshift, Amazon QuickSight, AWS Data Pipeline, AWS Glue and AWS Lake Formation. AWS solutions include machine learning, analytics and data lakes, Internet of Things, serverless computing, containers, enterprise applications, and storage. In addition, the Company provides services, such as advertising. It also offers Amazon Prime, a membership program that includes free shipping, access to streaming of various of movies and television (TV) episodes.", "FB": "Facebook, Inc. is focused on building products that enable people to connect and share through mobile devices, personal computers and other surfaces. The Company's products include Facebook, Instagram, Messenger, WhatsApp and Oculus. Facebook enables people to connect, share, discover and communicate with each other on mobile devices and personal computers. Instagram enables people to take photos or videos, customize them with filter effects, and share them with friends and followers in a photo feed or send them directly to friends. Messenger allows communicating with people and businesses alike across a range of platforms and devices. WhatsApp Messenger is a messaging application that is used by people around the world and is available on a range of mobile platforms. Its Oculus virtual reality technology and content platform offers products that allow people to enter an interactive environment to play games, consume content and connect with others.", "ADBE": "Adobe Inc., formerly Adobe Systems Incorporated, is a software company. The Company offers products and services used by professionals, marketers, knowledge workers, application developers, enterprises and consumers for creating, managing, measuring, optimizing and engaging with compelling content and experiences. It operates through three segments: Digital Media, Digital Experience and Publishing. Its Digital Media segment provides tools and solutions that enable individuals, small and medium businesses and enterprises to create, publish, promote and monetize their digital content. Its Digital Experience segment provides solutions and services for how digital advertising and marketing are created, managed, executed, measured and optimized. Its Publishing segment addresses market opportunities ranging from the diverse authoring and publishing needs of technical and business publishing to its legacy type and original equipment manufacturer printing businesses.", "ADI": "Analog Devices, Inc. (Analog Devices) designs, manufactures and markets a portfolio of solutions that leverage high-performance analog, mixed-signal and digital signal processing technology, including integrated circuits (ICs), algorithms, software and subsystems. Its products include Analog Products, Converters, Amplifiers/Radio Frequency, Other Analog, Power Management and Reference, and Digital Signal Processing Products. The Company is a supplier of data converter products. The Company is a supplier of high-performance amplifiers. Its analog product line also includes products of high performance radio frequency (RF) ICs. The Company's DSPs are used for high-speed numeric calculations. The Company offers its products for applications in various end markets, such as industrial, automotive, consumer and communications. The Company operates in the United States, Rest of North/South America, Europe, Japan and China.", "ADP": "Automatic Data Processing, Inc. (ADP) is a provider of human capital management (HCM) solutions to employers, offering solutions to businesses of various sizes. The Company also provides business process outsourcing solutions. Its segments include Employer Services and Professional Employer Organization (PEO) Services. The Employer Services segment offers a range of human resources (HR) business process outsourcing and technology-enabled HCM solutions. These offerings include payroll services, benefits administration, talent management, HR management, time and attendance management, insurance services, retirement services, and tax and compliance services. ADP TotalSource, ADP's PEO business, offers small and mid-sized businesses a HR outsourcing solution through a co-employment model. As a PEO, ADP TotalSource provides HR management services while the client continues to direct the day-to-day job-related duties of the employees.", "ADSK": "Autodesk, Inc. is a design software and services company, offering customers productive business solutions through technology products and services. The Company's segments include Architecture, Engineering and Construction (AEC), Platform Solutions and Emerging Business (PSEB), Manufacturing (MFG), and Media and Entertainment (M&E). The Company serves customers in the architecture, engineering and construction; product design and manufacturing; and digital media and entertainment industries. The Company's product development and manufacturing software provides manufacturers in automotive, transportation, industrial machinery, consumer products and building products with digital engineering solutions. The Company's product offerings include, AutoCAD, AutoCAD LT, Industry Collections, 3ds Max, Maya, Revit, Inventor, AutoCAD Civil three dimensional (3D), CAM Solutions, Fusion 360, BIM 360 and Shotgun.", "AEP": "American Electric Power Company, Inc. (AEP) is a public utility holding company that owns, directly or indirectly, all of the outstanding common stock of its public utility subsidiaries and varying percentages of other subsidiaries. The service areas of the Company's public utility subsidiaries cover the states of Arkansas, Indiana, Kentucky, Louisiana, Michigan, Ohio, Oklahoma, Tennessee, Texas, Virginia and West Virginia. The Company's segments include Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation & Marketing. AEP's vertically integrated utility operations are engaged in the generation, transmission and distribution of electricity for sale to retail and wholesale customers. Transmission and Distribution Utilities segment consists of the transmission and distribution of electricity for sale to retail and wholesale customers. AEP Transmission Holdco develops, constructs and operates transmission facilities.", "ALXN": "Deciphera Pharmaceuticals, Inc. is a clinical-stage biopharmaceutical company. The Company is developing drugs to improve the lives of cancer patients. Its drug candidate includes DCC-2618, DCC-3014 and Rebastinib. Its proprietary kinase switch control inhibitor platform, inhibit the activation of kinases. DCC-2618, an orally administered kinase switch control inhibitor, for the treatment of gastrointestinal stromal tumors (GIST), advanced systemic mastocytosis (ASM), gliomas, including glioblastoma multiforme (GBM), and other solid tumors driven by pan-KIT or PDGFR alpha. DCC-3014 is an orally administered, potent and highly selective inhibitor of colony stimulating factor receptor 1 (CSF1R). Rebastinib is an orally administered, potent and selective inhibitor of the TIE2 immunokinase. Rebastinib binds potently into the switch pocket of TIE2, stabilizing the inhibitory switch and displacing the activation switch to block TIE2 signaling.", "REGN": "Deciphera Pharmaceuticals, Inc. is a clinical-stage biopharmaceutical company. The Company is developing drugs to improve the lives of cancer patients. Its drug candidate includes DCC-2618, DCC-3014 and Rebastinib. Its proprietary kinase switch control inhibitor platform, inhibit the activation of kinases. DCC-2618, an orally administered kinase switch control inhibitor, for the treatment of gastrointestinal stromal tumors (GIST), advanced systemic mastocytosis (ASM), gliomas, including glioblastoma multiforme (GBM), and other solid tumors driven by pan-KIT or PDGFR alpha. DCC-3014 is an orally administered, potent and highly selective inhibitor of colony stimulating factor receptor 1 (CSF1R). Rebastinib is an orally administered, potent and selective inhibitor of the TIE2 immunokinase. Rebastinib binds potently into the switch pocket of TIE2, stabilizing the inhibitory switch and displacing the activation switch to block TIE2 signaling.", "MU": "Micron Technology, Inc. is engaged in semiconductor systems. The Company's portfolio of memory technologies, including dynamic random-access memory (DRAM), negative-AND (NAND) Flash and NOR Flash are the basis for solid-state drives, modules, multi-chip packages and other system solutions. Its business segments include Compute and Networking Business Unit (CNBU), which includes memory products sold into compute, networking, graphics and cloud server markets; Mobile Business Unit (MBU), which includes memory products sold into smartphone, tablet and other mobile-device markets; Storage Business Unit (SBU), which includes memory products sold into enterprise, client, cloud and removable storage markets, and SBU also includes products sold to Intel through its Intel/Micron Flash Technology (IMFT) joint venture, and Embedded Business Unit (EBU), which includes memory products sold into automotive, industrial, connected home and consumer electronics markets.", "ALGN": "Micron Technology, Inc. is engaged in semiconductor systems. The Company's portfolio of memory technologies, including dynamic random-access memory (DRAM), negative-AND (NAND) Flash and NOR Flash are the basis for solid-state drives, modules, multi-chip packages and other system solutions. Its business segments include Compute and Networking Business Unit (CNBU), which includes memory products sold into compute, networking, graphics and cloud server markets; Mobile Business Unit (MBU), which includes memory products sold into smartphone, tablet and other mobile-device markets; Storage Business Unit (SBU), which includes memory products sold into enterprise, client, cloud and removable storage markets, and SBU also includes products sold to Intel through its Intel/Micron Flash Technology (IMFT) joint venture, and Embedded Business Unit (EBU), which includes memory products sold into automotive, industrial, connected home and consumer electronics markets.", "AMAT": "Eagle Materials Inc. is a supplier of construction products, building materials and materials used for oil and natural gas extraction. The Company operates through five segments: Cement, Concrete and Aggregates, Gypsum Wallboard, Recycled Paperboard, and Oil and Gas Proppants. The Company's construction products are used in residential, commercial and infrastructure construction, and include cement, slag, concrete and aggregates. Its basic materials used for oil and natural gas extraction include frac sand and oil well cement. It sells cement in various regional markets, including Texas, Illinois, the central plains, Michigan, Iowa, the Rocky Mountains, northern Nevada, southern Ohio and northern California. It sells slag in the greater Chicago, Illinois area. It also operates a recycled paperboard business, which sells internally to its wallboard business, as well as to external customers. It sells oil well cement and frac sand to shale deposit zones across the United States.", "AMD": "Advanced Micro Devices, Inc. is a global semiconductor company. The Company is engaged in offering x86 microprocessors, as standalone devices or as incorporated into an accelerated processing unit (APU), chipsets, discrete graphics processing units (GPUs) and professional graphics, and server and embedded processors and semi-custom System-on-Chip (SoC) products and technology for game consoles. The Company's segments include the Computing and Graphics segment, and the Enterprise, Embedded and Semi-Custom segment. The Computing and Graphics segment primarily includes desktop and notebook processors and chipsets, discrete GPUs and professional graphics. The Enterprise, Embedded and Semi-Custom segment primarily includes server and embedded processors, semi-custom SoC products, development services, technology for game consoles and licensing portions of its intellectual property portfolio.", "AMGN": "Amgen Inc. is a biotechnology company. The Company discovers, develops, manufactures and delivers various human therapeutics. It operates in human therapeutics segment. Its marketed products portfolio includes Neulasta (pegfilgrastim); erythropoiesis-stimulating agents (ESAs), such as Aranesp (darbepoetin alfa) and EPOGEN (epoetin alfa); Sensipar/Mimpara (cinacalcet); XGEVA (denosumab); Prolia (denosumab); NEUPOGEN (filgrastim), and other marketed products, such as KYPROLIS (carfilzomib), Vectibix (panitumumab), Nplate (romiplostim), Repatha (evolocumab), BLINCYTO (blinatumomab), IMLYGIC (talimogene laherparepvec) and Corlanor (ivabradine). It focuses on human therapeutics for the treatment of serious illness in the areas of oncology/hematology, cardiovascular disease and neuroscience. Its product candidates in Phase III include Erenumab for episodic migraine, Aranesp for myelodysplastic syndromes, BLINCYTO for acute lymphoblastic leukemia and IMLYGIC for metastatic melanoma.", "ANSS": "ANSYS, Inc. (ANSYS) develops and markets engineering simulation software and services used by engineers, designers, researchers and students across a range of industries and academia, including aerospace and defense, automotive, industrial equipment, electronics, biomedical, energy, materials and chemical processing, and semiconductors. The Company focuses on the development of open and flexible solutions that enable users to analyze designs directly on the desktop, providing a common platform for product development, from design concept to final-stage testing and validation. The Company distributes its ANSYS suite of simulation technologies through a network of independent resellers and distributors, and direct sales offices in various locations. Its product portfolio consists of Simulation Platform: ANSYS Workbench, Structures, Fluids, Electronics, Semiconductors, Multiphysics, AIM, Embedded Software, Systems, Three Dimensional (3-D) Direct Modeling and Academic.", "ASML": "ASML Holding N.V. is a holding company. The Company is a manufacturer of chip-making equipment. The Company is engaged in the development, production, marketing, selling and servicing of semiconductor equipment systems, consisting of lithography systems. The Company's products include systems, and installed base products and services. The Company's principal operations are in the Netherlands, the United States and Asia. The Company offers TWINSCAN systems, equipped with lithography system with a mercury lamp as light source (i-line), Krypton Fluoride (KrF) and Argon Fluoride (ArF) light sources for 300 millimeter processing wafers for manufacturing environments for which imaging at a small resolution is required. TWINSCAN systems also include immersion lithography systems (TWINSCAN immersion systems). The Company also offers NXE systems, which are equipped with extreme ultraviolet (EUV) light source technology. The Company offers YieldStar, a wafer metrology system.", "ATVI": "Activision Blizzard, Inc. is a developer and publisher of interactive entertainment content and services. The Company develops and distributes content and services across various gaming platforms, including video game consoles, personal computers (PC) and mobile devices. Its segments include Activision Publishing, Inc. (Activision), Blizzard Entertainment, Inc. (Blizzard), King Digital Entertainment (King) and Other. Activision is a developer and publisher of interactive software products and content. Blizzard is engaged in developing and publishing of interactive software products and entertainment content, particularly in PC gaming. King is a mobile entertainment company. It is engaged in other businesses, including The Major League Gaming (MLG) business; The Activision Blizzard Studios (Studios) business, and The Activision Blizzard Distribution (Distribution) business. It also develops products spanning other genres, including action/adventure, role-playing and simulation.", "AVGO": "Broadcom Inc., formerly Broadcom Limited, is a designer, developer and global supplier of a range of semiconductor devices with a focus on digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products. The Company operates through four segments: Wired Infrastructure, Wireless Communications, Enterprise Storage, and Industrial & Other. It offers a range of products that are used in end-products, such as enterprise and data center networking, home connectivity, set-top boxes, telecommunication equipment, smartphones, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Its product portfolio ranges from discrete devices to complex sub-systems that include multiple device types, and also includes firmware for interfacing between analog and digital systems. Its products include mechanical hardware that interfaces with optoelectronic or capacitive sensors.", "MAR": "RPM International Inc., through its subsidiaries, manufactures, markets and sells various specialty chemical product lines, including specialty paints, protective coatings, roofing systems, sealants and adhesives, focusing on the maintenance of industrial, specialty and consumer markets. The Company operates through three segments: the industrial reportable segment (industrial segment), the specialty reportable segment (specialty segment) and the consumer reportable segment (consumer segment). Its family of products includes those marketed under brand names, such as API, Carboline, CAVE, DAP, Day-Glo, Dri-Eaz, Dryvit, Euclid, EUCO, Fibergrate, Flecto, Flowcrete, Grupo PV, Hummervoll, illbruck, Mohawk, Rust-Oleum, Stonhard, TCI, Toxement, Tremco, Tuf-Strand, Universal Sealants, Viapol, Watco and Zinsser. As of May 31, 2016, its subsidiaries marketed products in approximately 164 countries and territories, and operated manufacturing facilities in approximately 120 locations.", "BIDU": "Baidu, Inc. is a Chinese language Internet search provider. The Company offers a Chinese language search platform on its Baidu.com Website that enables users to find information online, including Webpages, news, images, documents and multimedia files, through links provided on its Website. In addition to serving individual Internet search users, the Company provides a platform for businesses to reach customers. Its business consists of three segments: search services, transaction services and iQiyi. Search services are keyword-based marketing services targeted at and triggered by Internet users' search queries, which mainly include its pay-for-performance (P4P) services and other online marketing services. Its transaction services include Baidu Nuomi, Baidu Takeout Delivery, Baidu Maps, Baidu Connect, Baidu Wallet and others. iQiyi is an online video platform with a content library that includes licensed movies, television series, cartoons, variety shows and other programs.", "BIIB": "Biogen Inc. is a biopharmaceutical company. The Company focuses on discovering, developing, manufacturing and delivering therapies to people living with serious neurological, rare and autoimmune diseases. The Company markets products, including TECFIDERA, AVONEX, PLEGRIDY, TYSABRI, ZINBRYTA and FAMPYRA for multiple sclerosis (MS), FUMADERM for the treatment of severe plaque psoriasis and SPINRAZA for the treatment of spinal muscular atrophy (SMA). It also has a collaboration agreement with Genentech, Inc. (Genentech), a member of the Roche Group, with respect to RITUXAN for the treatment of non-Hodgkin's lymphoma, chronic lymphocytic leukemia (CLL) and other conditions, GAZYVA indicated for the treatment of CLL and follicular lymphoma, and other anti-CD20 therapies. The Company's product candidate includes OCREVUS; Biosimilar adalimumab; Aducanumab; E2609; BIIB074; BAN2401; Opicinumab; CIRARA; BIIB061; BIIB054; BIIB067, and BIIB068.", "BKNG": "Booking Holdings Inc., formerly The Priceline Group Inc., is a provider of travel and restaurant online reservation and related services. The Company, through its online travel companies (OTCs), connects consumers wishing to make travel reservations with providers of travel services across the world. It offers consumers an array of accommodation reservations (including hotels, bed and breakfasts, hostels, apartments, vacation rentals and other properties) through its Booking.com, priceline.com and agoda.com brands. Its other brands include KAYAK, Rentalcars.com and OpenTable, Inc. (OpenTable). As of December 31, 2016, Booking.com offered accommodation reservation services for over 1,115,000 properties in over 220 countries and territories on its various Websites and in over 40 languages, which included over 568,000 vacation rental properties.", "CPRT": "Corteva, Inc. is a provider of agricultural products. The Companys seed platform develops and supplies germplasm. Its crop protection platform supplies products to protect crop yields against weeds, insects and disease. It operates through two segments: seed and crop protection. Its seed segment provides solutions in various crops, including corn, soybean, sunflowers and wheat, and complementary crops such as alfalfa, canola, cotton, rice and sorghum, as well as silage inoculants. Its crop protection segment is focused on developing and supplying crop protection products and services. It offers a range of crop protection products that service field crops, such as wheat, corn, soybean, sunflower, canola/oilseed rape and rice as well as specialty crops such as fruit, nut, vine, sugarcane, coffee and vegetables.", "CDNS": "Cadence Design Systems, Inc. provides solutions that enable its customers to design electronic products. The Company's product categories include Functional Verification, Digital integrated circuits (IC) Design and Signoff, Custom IC Design and Verification, System Interconnect and Analysis, and intellectual property (IP). Functional verification products are used to verify that the circuitry or the software designed will perform as intended. Digital IC design offerings are used to create representations of a digital circuit or an IC that can be verified for correctness prior to implementation. Custom IC design and verification offerings are used to create schematic and physical representations of circuits down to the transistor level for analog and memory designs. System Interconnect and Analysis offerings are used to develop printed circuit boards and IC packages. Design IP offerings consist of functional blocks, which customers integrate into their ICs for the development process.", "CHKP": "Check Point Software Technologies Ltd. (Check point) develops, markets and supports a range of products and services for information technology (IT) security. The Company's products and services are sold to enterprises, service providers, small and medium sized businesses and consumers. It offers enterprises a platform to deploy independent, modular and interoperable security applications (Software Blades), such as firewall, virtual private network (VPN), intrusion prevention system (IPS), Application Control, Anti-Bot, antivirus, data loss prevention (DLP), policy management, event analysis or multi-domain management. The Company offers Software Blades grouped into functional packages to address specific security issues. It has product offerings under these packages, which include Next Generation Firewall, Next Generation Threat Prevention, Next Generation Secure Web Gateway and Next Generation Data Protection.", "CHTR": "Verizon Communications Inc. is a holding company. The Company, through its subsidiaries, provides communications, information and entertainment products and services to consumers, businesses and governmental agencies. Its segments include Wireless and Wireline. The Wireless segment offers communications products and services, including wireless voice and data services and equipment sales, to consumer, business and government customers across the United States. The Wireline segment offers voice, data and video communications products and services, such as broadband video, data center and cloud services, security and managed network services, and local and long distance voice services. The Company has combined Yahoo! Inc.s operating assets with its existing AOL Inc. business to create a new subsidiary, Oath Inc., owns a diverse house of more than 50 media and technology brands. The Oath portfolio includes HuffPost, Yahoo Sports, AOL.com, MAKERS, Tumblr, Yahoo Finance and Yahoo Mail.", "MRNA": "Moderna, Inc. is engaged in transformative medicines based on messenger ribonucleic acid (mRNA). It has created a platform to improve the underlying pharmaceutical properties of our mRNA medicines. Its platform consists of three areas: mRNA technologies, delivery technologies, and manufacturing processes. It is pursuing mRNA science to minimize the undesirable activation of the immune system by mRNA and to maximize the potency of mRNA once in the target cells. It has advanced in parallel a diverse development pipeline of 21 programs, of which 10 have entered clinical studies and another three have open INDs. Its therapeutics and vaccine development programs span infectious diseases, oncology, cardiovascular diseases, and rare genetic diseases. It has created six modalities prophylactic vaccines, cancer vaccines, intratumoral immmuno-oncology, localized regenerative therapeutics, systemic secreted therapeutics and systemic intracellular therapeutics. ", "MTCH": "Match Group, Inc. is a provider of dating products. The Company operates in the Dating segment. The Dating segment consists of all of its dating businesses across the globe. As of March 31, 2017, the Company operated a portfolio of over 45 brands, including Match, Tinder, PlentyOfFish, Meetic, OkCupid, Pairs, Twoo, OurTime, BlackPeopleMeet and LoveScout24, each designed to manage its users' likelihood of finding a romantic connection. As of March 31, 2017, the Company offered its dating products in 42 languages across more than 190 countries.", "COST": "Costco Wholesale Corporation is engaged in the operation of membership warehouses in the United States and Puerto Rico, Canada, the United Kingdom, Mexico, Japan, Australia, Spain, and through its subsidiaries in Taiwan and Korea. As of August 28, 2016, the Company operated 715 warehouses across the world. The Company's average warehouse space is approximately 144,000 square feet. The Company's warehouses on average operate on a seven-day, 70-hour week. The Company offers merchandise in various categories, which include foods (including dry foods, packaged foods and groceries); sundries (including snack foods, candy, alcoholic and nonalcoholic beverages, and cleaning supplies); hardlines (including appliances, electronics, health and beauty aids, hardware, and garden and patio); fresh foods (including meat, produce, deli and bakery); softlines (including apparel and small appliances), and other (including gas stations and pharmacy).", "CSCO": "Citrix Systems, Inc. offers Enterprise and Service Provider products, which include Workspace Services solutions and Delivery Networking products. The Company's Enterprise and Service Provider products include Cloud Services solutions, and related license updates and maintenance, support and professional services. The Company's NetScaler nCore Technology is an architecture that enables execution of multiple packet engines in parallel. The Company's workspace services include Application Virtualization and virtual desktop infrastructure (VDI), Enterprise Mobility Management and Citrix Workspace Suite. The Company's NetScaler ADC is a software-defined application delivery controller (ADC) and load balancer. The Company's Cloud Services include ShareFile and Citrix Cloud. It provides various ways for customers to receive upgrades, support and maintenance for products, which include Software Maintenance, Subscription Advantage, Technical Support Services and Hardware Maintenance.", "CTSH": "Cognizant Technology Solutions Corporation is a professional services company. The Company operates through four segments: Financial Services, Healthcare, Manufacturing/Retail/Logistics, and Other. The Financial Services segment includes customers providing banking/transaction processing, capital markets and insurance services. The Healthcare segment includes healthcare providers and payers, as well as life sciences customers, including pharmaceutical, biotech and medical device companies. The Manufacturing/Retail/Logistics segment includes manufacturers, retailers, travel and other hospitality customers, as well as customers providing logistics services. The Other segment includes its information, media and entertainment services, communications and high technology operating segments. Its services include consulting and technology services and outsourcing services. Its outsourcing services include application maintenance, IT infrastructure services and business process services.", "MRVL": "Micron Technology, Inc. is engaged in semiconductor systems. The Company's portfolio of memory technologies, including dynamic random-access memory (DRAM), negative-AND (NAND) Flash and NOR Flash are the basis for solid-state drives, modules, multi-chip packages and other system solutions. Its business segments include Compute and Networking Business Unit (CNBU), which includes memory products sold into compute, networking, graphics and cloud server markets; Mobile Business Unit (MBU), which includes memory products sold into smartphone, tablet and other mobile-device markets; Storage Business Unit (SBU), which includes memory products sold into enterprise, client, cloud and removable storage markets, and SBU also includes products sold to Intel through its Intel/Micron Flash Technology (IMFT) joint venture, and Embedded Business Unit (EBU), which includes memory products sold into automotive, industrial, connected home and consumer electronics markets.", "IDXX": "IDEXX Laboratories, Inc. develops, manufactures and distributes products and provides services for the companion animal veterinary, livestock and poultry, dairy and water testing markets. The Company also sells a line of portable electrolytes and blood gas analyzers for the human point-of-care medical diagnostics market. Its segments include diagnostic and information technology-based products and services for the veterinary market, which the Company refers to as the Companion Animal Group; water quality products; diagnostic products and services for livestock and poultry health, which the Company refers to as Livestock, Poultry and Dairy, and Other operating segment, which combines and presents products for the human point-of-care medical diagnostics market with its pharmaceutical product line and its out-licensing arrangements. Its products and services include point-of-care veterinary diagnostic products, comprising instruments, consumables and rapid assay test kits, among others.", "DLTR": "Dollar Tree, Inc. is an operator of discount variety stores. As of January 28, 2017, the Company operated 14,334 stores in 48 states and the District of Columbia, and five Canadian provinces. Its segments include Dollar Tree and Family Dollar. The Dollar Tree segment is the operator of discount variety stores offering merchandise at a fixed price. The Family Dollar segment operates a chain of general merchandise retail discount stores providing consumers with a selection of merchandise in neighborhood stores. Its stores operate under the names of Dollar Tree, Family Dollar and Dollar Tree Canada. As of January 28, 2017, the Dollar Tree segment included 6,360 stores operating under the Dollar Tree and Dollar Tree Canada brands, 11 distribution centers in the United States and two in Canada and a Store Support Center in Chesapeake, Virginia, and 11 distribution centers and a Store Support Center in Matthews, North Carolina under the Family Dollar brand.", "DOCU": "DocuSign, Inc. automates manual, paper-based processes with the open, independent, standards-based digital transaction management (DTM) platform for managing all aspects of documented business transactions. Customers can open new accounts and start loans in minutes. The Company helps banks give customers the convenience of anywhere, anytime access for completing forms, contracts or lending documents. The Company works simply on any Internet connected device including all mobile devices. The Company offers a he following product editions with varying combinations of functionality: trial, single-user, multi-user, business pro, enterprise pro, standards-based signatures, ehanko, DocuSign transaction rooms for real estate, DocuSign payments, and enotary. In Trial user can send documents for signature, basic fields, such as signature, date, name, and text, mobile app, basic workflows, real-time audit trail, integration with Dropbox, Google Drive, and more, and multiple languages.", "DXCM": "Dexcom, Inc. (Dexcom) is a medical device company. The Company is focused on the design, development and commercialization of continuous glucose monitoring (CGM) systems for ambulatory use by people with diabetes and for use by healthcare providers. The Company's products consist of DexCom G4 PLATINUM and DexCom G5 Mobile. The Company is commercializing its fifth generation CGM system. The Company's markets DexCom G4 PLATINUM under a Conformite Europeenne Marking (CE Mark), in the European Union, Australia, New Zealand and the countries in Asia and Latin America, and in the United States with approval from the United States Food and Drug Administration (FDA). The DexCom G4 PLATINUM with Share remote monitoring system uses a wireless connection between a patient's receiver and an application on the patient's iPhone, iPod touch, or iPad to transmit glucose information to applications on the mobile devices of designated recipients (followers).", "EA": "Electronic Arts Inc. develops, markets, publishes and distributes games, content and services that can be played by consumers on a range of platforms, which include consoles, personal computers (PCs), mobile phones and tablets. The Company's games and services are based on a portfolio of intellectual property that includes established brands, such as FIFA, Madden NFL, Star Wars, Battlefield, the Sims and Need for Speed. The Company markets and sells its games and services through retail channels and through digital distribution channels. The Company's PC games and additional content can be downloaded directly through its Origin online platform, as well as through third-party online download stores. Its mobile, tablet and PC free-to-download games and additional content are available through third-party application storefronts, such as the Apple Application Store and Google Play.", "EBAY": "eBay Inc. (eBay) is a commerce company, which operates through its Marketplace, StubHub and Classifieds platforms. The Company connects buyers and sellers around the world. Its platforms enable sellers around the world to organize and offer their inventory for sale, and buyers to find and purchase it. Its platforms are accessible through an online experience (desktop and laptop computers), from mobile devices (smartphones and tablets) and by application programming interface (API) (platform access for third-party software developers). The Company's Marketplace platforms include its online marketplace located at www.ebay.com, localized counterparts and the eBay mobile applications. The Company's StubHub platforms include its online ticket platform located at www.stubhub.com, the StubHub mobile applications and Ticketbis. The Company's Classifieds platforms include a collection of brands, such as Mobile.de, Kijiji, Gumtree, Marktplaats, eBay Kleinanzeigen and others.", "FISV": "Fiserv, Inc. is a provider of financial services technology. The Company provides account processing systems; electronic payments processing products and services, such as electronic bill payments, transaction processing, account-to-account transfers, and person-to-person payments; Internet and mobile banking systems, and related services, including document and payment card production and distribution, and lending and risk management products and services. The Company operates through two segments: Payments and Industry Products and the Financial Institution Services. The Payments segment services include electronic bill payment and presentment services, Internet and mobile banking software and services, and other electronic payments software and services. The Financial segment provides account processing services, item processing and source capture services, loan origination and servicing products, cash management and consulting services, and other products and services.", "GILD": "Gilead Sciences, Inc. is a research-based biopharmaceutical company that discovers, develops and commercializes medicines in areas of unmet medical need. The Company's portfolio of products and pipeline of investigational drugs includes treatments for Human Immunodeficiency Virus/Acquired Immune Deficiency Syndrome (HIV/AIDS), liver diseases, cancer, inflammatory and respiratory diseases and cardiovascular conditions. Its products for HIV/AIDS patients include Descovy, Odefsey, Genvoya, Stribild, Complera/Eviplera, Truvada, Emtriva, Tybost and Vitekta. Its products for patients with liver diseases include Vemlidy, Epclusa, Harvoni, Sovaldi, Viread and Hepsera. It offers Zydelig to patients with hematology/oncology diseases. Its products for patients with various cardiovascular diseases include Letairis, Ranexa and Lexiscan. Its products for various inflammation/respiratory diseases include Cayston and Tamiflu. It had operations in more than 30 countries, as of December 31, 2016.", "MDLZ": "RPM International Inc., through its subsidiaries, manufactures, markets and sells various specialty chemical product lines, including specialty paints, protective coatings, roofing systems, sealants and adhesives, focusing on the maintenance of industrial, specialty and consumer markets. The Company operates through three segments: the industrial reportable segment (industrial segment), the specialty reportable segment (specialty segment) and the consumer reportable segment (consumer segment). Its family of products includes those marketed under brand names, such as API, Carboline, CAVE, DAP, Day-Glo, Dri-Eaz, Dryvit, Euclid, EUCO, Fibergrate, Flecto, Flowcrete, Grupo PV, Hummervoll, illbruck, Mohawk, Rust-Oleum, Stonhard, TCI, Toxement, Tremco, Tuf-Strand, Universal Sealants, Viapol, Watco and Zinsser. As of May 31, 2016, its subsidiaries marketed products in approximately 164 countries and territories, and operated manufacturing facilities in approximately 120 locations.", "ILMN": "Illumina, Inc. (Illumina) is a provider of sequencing- and array-based solutions for genetic analysis. The Company operates through two segments: Core Illumina and the consolidated variable interest entities (VIEs), which include the activities of GRAIL, Inc. (GRAIL) and Helix Holdings I, LLC (Helix). Core Illumina consists of its core operations. Core Illumina's products and services serve customers in the research, clinical and applied markets, and enable the adoption of a range of genomic solutions. The Company's portfolio of integrated systems, consumables and analysis tools addresses the range of genomic complexity, price points, and throughput, enabling customers to select the solution for their research or clinical challenge. The Company provides reproductive-health solutions, including noninvasive prenatal testing (NIPT), preimplantation genetic screening and diagnosis, and neonatal and genetic health testing.", "INTU": "Intuit Inc. is a provider of business and financial management solutions for small businesses, consumers and accounting professionals. The Company operates through three segments: Small Business, Consumer Tax and ProConnect. The Small Business segment serves and advises small businesses and the accounting professionals, and includes QuickBooks financial and business management online services and desktop software, payroll solutions, and payment processing solutions. The Small Business segment also includes third-party applications that integrate with the Company's offerings. The Consumer Tax segment targets consumers and includes TurboTax products and services, which enable individuals to prepare and file their own federal and state personal income tax returns. The ProConnect segment targets professional accountants in the United States and Canada. Its ProConnect professional tax offerings include Lacerte, ProSeries, ProFile and ProConnect Tax Online.", "ISRG": "Intuitive Surgical, Inc. (Intuitive) designs, manufactures and markets da Vinci Surgical Systems, and related instruments and accessories. The Company's da Vinci Surgical System consists of a surgeon's console, a patient-side cart and a vision system. The da Vinci Surgical System translates a surgeon's hand movements, which are performed on instrument controls at a console, into corresponding micro-movements of instruments positioned inside the patient through small incisions or ports. The da Vinci Surgical System provides its operating surgeons with control, range of motion, tissue manipulation capability and three-dimensional (3-D), high-definition (HD) vision. Intuitive has four generations of da Vinci Surgical System: the da Vinci Xi Surgical System, the da Vinci Si Surgical System, the da Vinci S Surgical System and the standard da Vinci Surgical System. The Company's instruments and accessories include EndoWrist Instruments and da Vinci Single-Site.", "JD": "JD.com, Inc. is an online direct sales company. The Company engages in the sale of electronics and home appliance products and general merchandise products (including audio, video products and books) sourced from manufacturers, distributors and publishers in China on the Internet through its Website, www.jd.com. It also offers an online marketplace that enables third-party sellers to sell their products to customers on the Company's Website. The Company operates through the provision of a single class of services for accelerating and improving the delivery of its products over the Internet. The Company also offers online and in-person payment options and customer services. The Company operates approximately 210 warehouses with an aggregate gross floor area of approximately four million square meters in over 50 cities. It operates over 5,370 delivery stations and pickup stations in approximately 2,350 counties and districts across China.", "KHC": "The Kraft Heinz Company is a food and beverage company. The Company is engaged in the manufacturing and marketing of food and beverage products, including condiments and sauces, cheese and dairy, meals, meats, refreshment beverages, coffee and other grocery products. The Company's segments include the United States, Canada and Europe. The Company's remaining businesses are combined as Rest of World. The Rest of World consists of Latin America and Asia, Middle East and Africa (AMEA). The Company provides products for various occasions whether at home, in restaurants or on the go. The Company's brands include Heinz, Kraft, Oscar Mayer, Philadelphia, Planters, Velveeta, Lunchables, Maxwell House, Capri Sun, and Ore-Ida. The Company's products are sold through its own sales organizations and through independent brokers, agents and distributors to chain, wholesale, cooperative and independent grocery accounts, convenience stores, drug stores, value stores, bakeries and pharmacies.", "LRCX": "Lam Research Corporation is a supplier of wafer fabrication equipment and services to the semiconductor industry. The Company designs, manufactures, markets, refurbishes and services semiconductor processing systems that are used in the fabrication of integrated circuits (ICs). It operates through manufacturing and servicing of wafer processing semiconductor manufacturing equipment segment. Its products are designed to enable its customers build a range of devices that are used in a range of electronic products, including cell phones, tablets, computers, storage devices, and networking equipment. Its customer base includes semiconductor memory, foundry, and integrated device manufacturers (IDMs) that make products, such as dynamic random-access memory (DRAM), negative-AND (NAND) memory and logic devices. It offers a portfolio of products that are used in several areas of the semiconductor manufacturing process flow, including thin film deposition, plasma etch and single-wafer clean.", "LULU": "lululemon athletica inc. is a designer, distributor and retailer of athletic apparel. The Company operates through two segments: Company-operated stores and Direct to consumer. It is also engaged in the sale from outlets, showrooms, sales from temporary locations, sales to wholesale accounts, warehouse sales, and license and supply arrangements. Its direct to consumer segment generates revenue from its lululemon and ivivva e-commerce Websites, www.lululemon.com and www.ivivva.com, and other country and region specific Websites. It offers a range of apparel and accessories for women, men and female youth. The Company's apparel assortment includes items, such as pants, shorts, tops, and jackets designed for healthy lifestyle and athletic activities, such as yoga, running, training, most other sweaty pursuits, and athletic wear for female youth. The Company also offers fitness-related accessories, including an array of items, such as bags, socks, underwear, yoga mats and water bottles.", "MCHP": "Microchip Technology Incorporated is engaged in developing, manufacturing and selling specialized semiconductor products used by its customers for a range of embedded control applications. The Company operates through two segments: semiconductor products and technology licensing. In the semiconductor products segment, the Company designs, develops, manufactures and markets microcontrollers, development tools and analog, interface, mixed signal and timing products. Its functional activities include sales, marketing, manufacturing, information technology, human resources, legal and finance. Its product portfolio comprises general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers, a spectrum of linear, mixed-signal, power management, thermal management, radio frequency (RF), timing, safety, security, wired connectivity and wireless connectivity devices, as well as serial electrically erasable programmable read-only memories (EEPROMs) and serial flash memories.", "MELI": "MercadoLibre, Inc. is an e-commerce company. The Company enables commerce through its marketplace platform in Latin America, which is designed to provide users with a portfolio of services to facilitate commercial transactions. Its geographic segments are Brazil, Argentina, Mexico Venezuela and Other Countries (which includes Chile, Colombia, Costa Rica, Dominican Republic, Ecuador, Panama, Peru, Portugal, Guatemala, Bolivia, Paraguay, Uruguay and the United States of America). It also operates online commerce platforms in the Dominican Republic, Honduras, Nicaragua, Salvador, Panama, Bolivia, Guatemala, Paraguay and Portugal. It offers an ecosystem of six integrated e-commerce services: the MercadoLibre Marketplace, the MercadoLibre Classifieds Service, the MercadoPago payments solution, the MercadoLibre advertising program, the MercadoShops online Webstores solution and the MercadoEnvios shipping service.", "MNST": "Monster Beverage Corporation develops, markets, sells and distributes energy drink beverages, sodas and/or concentrates for energy drink beverages, primarily under various brand names, including Monster Energy, Monster Rehab, Monster Energy Extra Strength Nitrous Technology, Java Monster, Muscle Monster, Mega Monster Energy, Punch Monster, Juice Monster, Ubermonster, BU, Mutant Super Soda, Nalu, NOS, Burn, Mother, Ultra, Play and Power Play, Gladiator, Relentless, Samurai, BPM and Full Throttle. The Company has three segments: Monster Energy Drinks segment, which consists of its Monster Energy drinks, as well as Mutant Super Soda drinks; Strategic Brands segment, which includes various energy drink brands owned through The Coca-Cola Company (TCCC), and Other segment (Other), which includes the American Fruits & Flavors (AFF) third-party products. The Strategic Brands segment sells concentrates and/or beverage bases to authorized bottling and canning operations.", "MXIM": "Maxim Integrated Products, Inc. is engaged in designing, developing, manufacturing and marketing a range of linear and mixed-signal integrated circuits, referred to as analog circuits. The Company also provides a range of high-frequency process technologies and capabilities for use in custom designs. The Company caters to automotive, communications and data center, computing, consumer and industrial markets. It offers a range of products, such as switching regulators, battery management, isolated power, charge pumps, linear regulators, light emitting diode (LED) drivers, motor driver integrated circuits (ICs), monitors and sequencers, transceivers, controllers and expanders, level translators, signal line protection ICs, broadband switches, powerline communications, real-time clocks, embedded security, microcontrollers, 1-Wire, iButton, data loggers, clock generation and distribution, memory products, optical, signal integrity, high-speed signaling, and display power and control.", "NFLX": "Netflix, Inc. is a provider an Internet television network. The Company operates through three segments: Domestic streaming, International streaming and Domestic DVD. The Domestic streaming segment includes services that streams content to its members in the United States. The International streaming segment includes services that streams content to its members outside the United States. The Domestic DVD segment includes services, such as digital optical disc (DVD)-by-mail. The Company's members can watch original series, documentaries, feature films, as well as television shows and movies directly on their Internet-connected screen, televisions, computers and mobile devices. It offers its streaming services both domestically and internationally. In the United States, its members can receive DVDs delivered to their homes. The Company had members streaming in over 190 countries, as of December 31, 2016.", "NTES": "Ventas, Inc. is a real estate investment trust (REIT) with its properties located throughout the United States, Canada and the United Kingdom. The Company operates through three segments: triple-net leased properties, senior living operations and office operations. Under its triple-net leased properties segment, the Company invests in and owns seniors housing and healthcare properties throughout the United States and the United Kingdom and leases those properties to healthcare operating companies under triple-net or absolute-net leases that obligate the tenants to pay all property-related expenses. In its senior living operations segment, it invests in seniors housing communities throughout the United States and Canada and engages independent operators to manage those communities. In its office operations segment, the Company primarily acquires, owns, develops, leases and manages medical office buildings (MOBs) and life science and innovation centers throughout the United States.", "NXPI": "NXP Semiconductors N.V. (NXP) is a holding company. The Company operates as a semiconductor company. The Company provides high performance mixed signal and standard product solutions. The Company's segments are High Performance Mixed Signal (HPMS), Standard Products (SP), and Corporate and Other. Its product solutions are used in a range of end-market applications, including automotive, personal security and identification, wireless and wireline infrastructure, mobile communications, multi-market industrial, consumer and computing. It engages with global original equipment manufacturers (OEMs) and sells products in all geographic regions. NXP's HPMS segment includes business lines, such as Automotive, Secure Identification Solutions (SIS), Secure Connected Devices (SCD), and Secure Interfaces and Infrastructure (SI&I). The Company's SP segment supplies a range of standard semiconductor components, such as small signal discretes and power discretes.", "OKTA": "Okta, Inc., is an independent provider of identity for the enterprise. The Company's Okta Identity Cloud platform provides identity management solutions that enable customers to secure their users and connect them to technology and applications. It also connects enterprises to their customers, employees, contractors, and partners. It allows users to access a range of cloud applications, Websites, mobile applications and service from various devices. Its platform is used by information technology (IT) organizations to secure their enterprise and by developers to build customer-facing Websites and applications. Okta Identity Cloud consists of a suite of products to manage and secure identities. It offers a range of products, such as Adaptive Multi-Factor Authentication, Universal Directory, Lifecycle Management products, Single Sign-On, application program interface (API) Access Management and Mobility Management. ", "ORLY": "O'Reilly Automotive, Inc. is a specialty retailer of automotive aftermarket parts, tools, supplies, equipment and accessories in the United States. The Company sells its products to both do-it-yourself (DIY) and professional service provider customers. The Company's product line includes new and remanufactured automotive hard parts, such as alternators, starters, fuel pumps, water pumps, brake system components, batteries, belts, hoses, temperature control, chassis parts, driveline parts and engine parts; maintenance items, such as oil, antifreeze, fluids, filters, wiper blades, lighting, engine additives and appearance products, and accessories, such as floor mats, seat covers and truck accessories. The Company's stores offer various services and programs to its customers, such as used oil, oil filter and battery recycling; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; custom hydraulic hoses, and machine shops.", "PAYX": "Paychex, Inc. is a provider of integrated human capital management (HCM) solutions for payroll, human resource (HR), retirement and insurance services for small- to medium-sized businesses in the United States. The Company also has operations in Germany. The Company offers services, including Payroll processing, Human Resource Services, and Accounting and Financial Services. As of May 31, 2016, the Company serviced approximately 605,000 payroll clients. It offers a portfolio of HCM services and products that allows its clients to meet their payroll and HR needs. Its payroll-related ancillary services and human resource service (HRS) offerings often leverage the information gathered in the base payroll processing service, allowing it to provide outsourcing services covering the HCM spectrum. The Company, through its HCM software-as-a-service platform, Paychex Flex, provides an integrated product suite that covers the employee life cycle from recruiting and hiring to retirement.", "PCAR": "PACCAR Inc (PACCAR) is a technology company. The Company's segments include Truck, Parts and Financial Services. The Truck segment includes the design, manufacture and distribution of light-, medium- and heavy-duty commercial trucks. The Company's trucks are marketed under the Kenworth, Peterbilt and DAF nameplates. It also manufactures engines, primarily for use in the Company's trucks, at its facilities in Columbus, Mississippi; Eindhoven, the Netherlands, and Ponta Grossa, Brazil. The Parts segment includes the distribution of aftermarket parts for trucks and related commercial vehicles. The Financial Services segment includes finance and leasing products and services provided to customers and dealers. Its Other business includes the manufacturing and marketing of industrial winches. The Company operates in Australia and Brazil and sells trucks and parts to customers in Asia, Africa, Middle East and South America.", "PEP": "PepsiCo, Inc. is a global food and beverage company. The Company's portfolio of brands includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker and Tropicana. The Company operates through six segments: Frito-Lay North America (FLNA), Quaker Foods North America (QFNA), North America Beverages (NAB), Latin America, Europe Sub-Saharan Africa (ESSA), and Asia, Middle East and North Africa (AMENA). The FLNA segment includes its branded food and snack businesses in the United States and Canada. The QFNA segment includes its cereal, rice, pasta and other branded food businesses in the United States and Canada. The NAB segment includes its beverage businesses in the United States and Canada. The Latin America segment includes its beverage, food and snack businesses in Latin America. The ESSA segment includes its beverage, food and snack businesses in Europe and Sub-Saharan Africa. The AMENA segment includes its beverage, food and snack businesses in Asia, Middle East and North Africa.", "PYPL": "PayPal Holdings, Inc. is a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants. The Company's combined payment solutions, including its PayPal, PayPal Credit, Braintree, Venmo, Xoom and Paydiant products, compose its Payments Platform. It operates a two-sided global technology platform that links its customers, both merchants and consumers, around the globe to facilitate the processing of payment transactions, allowing it to connect merchants and consumers. It allows its customers to use their account for both purchase and paying for goods, as well as to transfer and withdraw funds. It enables consumers to exchange funds with merchants using funding sources, which include bank account, PayPal account balance, PayPal Credit account, credit and debit card or other stored value products. It offers consumers person-to-person payment solutions through its PayPal Website and mobile application, Venmo and Xoom.", "PTON": "Peloton Interactive, Inc. is a provider of interactive fitness platform. The Company provides connected, technology-enabled fitness and the streaming of instructor-led boutique classes to its members. The Company operates and manages its business in three reportable segments: connected fitness product segment, subscription segment, and other segment. Its connected fitness product segment consists of its Bike and Tread and related accessories. Its other segment consists of Peloton branded apparels.", "ROST": "Ross Stores, Inc. and its subsidiaries operate two brands of off-price retail apparel and home fashion stores-Ross Dress for Less (Ross) and dd's DISCOUNTS. The Company is the off-price apparel and home fashion chain in the United States, with 1,340 locations in 36 states, the District of Columbia and Guam, as of January 28, 2017. The Company offers in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 60% off department and specialty store regular prices every day. The Company also operated 193 dd's DISCOUNTS stores in 15 states as of January 28, 2017. As of January 28, 2017, the Company operated a total of 1,533 stores consisted of 1,340 Ross stores and 193 dd's DISCOUNTS stores. As of January 28, 2017, the Company owned and operated six distribution processing facilities-three in California, one in Pennsylvania, and two in South Carolina.", "SIRI": "Sirius XM Holdings Inc. transmits music, sports, entertainment, comedy, talk, news, traffic and weather channels, as well as infotainment services, in the United States on a subscription fee basis through its two satellite radio systems. Subscribers can also receive music and other channels, and features, such as SiriusXM On Demand and MySXM, over its Internet radio service, including through applications for mobile devices, home devices and other consumer electronic equipment. It also provides connected vehicle services. It is developing a product, 360L, which combines its satellite and Internet services into a single, cohesive in-vehicle entertainment experience. It also offers satellite radio services to customers of certain rental car companies. Its Internet radio service also includes channels and features that are not available on its satellite radio service. As of December 31, 2016, the Company owned a fleet of five satellites: SIRIUS FM-5, SIRIUS FM-6, XM-3, XM-4 and XM-5.", "SNPS": "Synopsys, Inc. provides software, intellectual property (IP) and services. The Company supplies the electronic design automation (EDA) software that engineers use to design and test integrated circuits, also known as chips. It also offers IP products, which are pre-designed circuits that engineers use as components of larger chip designs rather than designing those circuits themselves. It provides software and hardware used to develop the electronic systems that incorporate chips and the software that runs on them. It provides technical services to support its solutions and help its customers develop chips and electronic systems. It is also a provider of software tools that developers use to develop software code in a range of industries, including electronics, financial services, energy, and industrials. It offers products and services in four categories: core EDA; IP, Systems and Software Integrity; Manufacturing Solutions, and Professional Services and Other.", "SPLK": "Splunk Inc. (Splunk) is engaged in the development and marketing of software solutions. The Company's offerings enable users to collect, index, search, explore, monitor and analyze data. Its offerings address diverse data sets that are referred to as big data and are specifically used for machine data. Machine data is produced by various software application and electronic devices in an organization and contains a definitive, time-stamped record of various activities, such as transactions, customer and user activities and security threats. Its products help users in various roles, including information technology (IT), security and business professionals, to analyze their machine data and achieve real-time visibility into and intelligence about their organization's operations. In addition, the Company offers user behavioral analytics to help detect, respond to and mitigate advanced, hidden and insider threats. The Company offers Splunk Enterprise, which is a machine data platform.", "SWKS": "Skyworks Solutions Inc. designs, develops, manufactures and markets semiconductor products, including intellectual property. The Company's analog semiconductors are connecting people, places, and things, spanning a number of new and unimagined applications within the automotive, broadband, cellular infrastructure, connected home, industrial, medical, military, smartphone, tablet and wearable markets. Its geographical segments include the United States, Other Americas, China, Taiwan, South Korea, Other Asia-Pacific, Europe, Middle East and Africa. It operates throughout the world with engineering, manufacturing, sales and service facilities throughout Asia, Europe and North America. It is engaged with key original equipment manufacturers (OEM), smartphone providers and baseband reference design partners. Its product portfolio consists of various solutions, including amplifiers, attenuators, detectors, diodes, filters, front-end modules, hybrid, mixers, switches, and modulators.", "TEAM": "Atlassian Corporation Plc is a holding company. The Company offers a range of team collaboration products. The Company offers products, including JIRA, Confluence, HipChat, Bitbucket and JIRA Service Desk, for software developers, information technology (IT) managers and knowledge workers. The Company offers JIRA for team planning and project management; Confluence for team content creation and sharing; HipChat for team real-time messaging and communications; Bitbucket for team code sharing and management, and JIRA Service Desk for team service and support applications. JIRA allows teams to organize their work into projects and customize dashboards for those projects to keep their teams aligned and on track. Confluence provides a system for organizing, sharing and securing content in spaces arranged by team, project, department and others. The Company also offers additional tools for software developers, such as FishEye, Clover, Crowd, Crucible, Bamboo and SourceTree.", "TMUS": "T-Mobile US, Inc. is a wireless company. As of December 31, 2016, the Company provided wireless communications services, including voice, messaging and data, to over 71 million customers in the postpaid, prepaid and wholesale markets. It provides services, devices and accessories across its brands, T-Mobile and MetroPCS. It provides wireless communication services through a range of service plan options. The Company offers a device trade-in program, Just Upgrade My Phone (JUMP!), which provides customers a specified-price trade-in right to upgrade their device. It offers a range of wireless devices, including handsets, tablets and other mobile communication devices, and accessories for sale, as well as financing through equipment installment plans (EIPs) and leasing through JUMP On Demand. The Company, through Layer3 TV provides television services that works on any device with an internet connection.", "TSLA": "Tesla, Inc., formerly Tesla Motors, Inc., designs, develops, manufactures and sells fully electric vehicles, and energy storage systems, as well as installs, operates and maintains solar and energy storage products. The Company operates through two segments: Automotive, and Energy generation and storage. The Automotive segment includes the design, development, manufacturing, and sales of electric vehicles. The Energy generation and storage segment includes the design, manufacture, installation, and sale or lease of stationary energy storage products and solar energy systems to residential and commercial customers, or sale of electricity generated by its solar energy systems to customers. The Company produces and distributes two fully electric vehicles, the Model S sedan and the Model X sport utility vehicle (SUV). It also offers Model 3, a sedan designed for the mass market. It develops energy storage products for use in homes, commercial facilities and utility sites.", "TXN": "Texas Instruments Incorporated designs, makes and sells semiconductors to electronics designers and manufacturers across the world. The Company operates through two segments: Analog and Embedded Processing. As of December 31, 2016, the Company had design, manufacturing or sales operations in more than 30 countries. The Company's Analog segment's product line includes High Volume Analog & Logic (HVAL), Power Management (Power), High Performance Analog (HPA) and Silicon Valley Analog (SVA). HVAL products support applications, such as automotive safety devices, touchscreen controllers, low-voltage motor drivers and integrated motor controllers. The Company's Embedded Processing segment's product line includes Processor, Microcontrollers and Connectivity. Processor products include digital signal processors (DSPs) and applications processors. DSPs perform mathematical computations to process digital data.", "VRSK": "Verisk Analytics, Inc. is a data analytics provider serving customers in insurance, natural resources and financial services. The Company operates through two segments: Risk Assessment and Decision Analytics. Its Risk Assessment segment serves its property and casualty insurance customers and focuses on prediction of loss, selection and pricing of risk, and compliance with their reporting requirements in each United States state in which they operate. In the Decision Analytics segment, the Company develops predictive models to forecast scenarios and produce both standard and customized analytics that help its customers manage their businesses, including predicting loss, selecting and pricing risk, detecting fraud before and after a loss event, and quantifying losses. It offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, natural resources intelligence, economic forecasting and various other fields.", "VRSN": "VeriSign, Inc. is a provider of domain name registry services and Internet security. The Company operates through Registry Services and Security Services segment. Registry Services ensure the security, stability and resiliency of Internet infrastructure and services, including the .com and .net domains, and operation of the root-zone maintainer functions for the core of the Internet's Domain Name System (DNS). Security Services provides infrastructure assurance services consisting of Distributed Denial of Services (DDoS) Protection Services and Managed DNS Services. DDoS Protection Services supports online business continuity by providing monitoring and mitigation services against DDoS attacks. Managed DNS Services is a hosting service that delivers DNS resolution for the availability of Web-based systems.", "VRTX": "Vertex Pharmaceuticals Incorporated is engaged in discovering, developing, manufacturing and commercializing medicines for serious diseases. The Company is focused on developing and commercializing therapies for the treatment of cystic fibrosis (CF) and advancing its research and development programs in other indications. The Company's marketed medicines are ORKAMBI and KALYDECO. ORKAMBI (lumacaftor in combination with ivacaftor) is approved as a treatment for patients having two copies (homozygous) of the Delta-F508 (F508del) mutation in their cystic fibrosis transmembrane conductance regulator (CFTR) gene. KALYDECO (ivacaftor) is approved for the treatment of CF patients having the G551D mutation or other specified mutations in their CFTR gene. The Company's development programs in the field of CF include Tezacaftor (VX-661), VX-152, VX-440, VX-659, VX-445 and VX-371. VX-152, VX-440, VX-659 and VX-445 are CFTR corrector compounds.", "ZM": "Zoom Video Communications, Inc. is a provider of video-first communication platform and Web conferencing services. It offers cloud-native platform, which unifies cloud video conferencing, online meetings, group messaging and a software-based conference room system, which enables users to easily experience Zoom Meetings in their physical meeting spaces. Its solution offers video, audio and screen-sharing experience across Windows, Mac, Linux, Android, BlackBerry, Zoom Rooms and H.323/Session Initiation Protocol room systems, such as Polycom and Cisco Tandberg. Its solutions include Meetings, Premium Audio, Business Instant Messaging (IM), Video Webinar, Zoom Rooms, H.323/SIP Connector and Developer Platform. Its cloud video conferencing solutions include full screen and gallery view, and dual stream for dual screen. Its security solutions include secure socket layer (SSL) encryption and role-based access control. It offers its solutions to education, finance and government sectors.", "WBA": "Walgreens Boots Alliance, Inc., is a holding company. The Company is a pharmacy-led health and wellbeing company. The Company operates through three segments: Retail Pharmacy USA, Retail Pharmacy International and Pharmaceutical Wholesale. The Retail Pharmacy USA segment consists of the Walgreen Co. (Walgreens) business, which includes the operation of retail drugstores, care clinics and providing specialty pharmacy services. The Retail Pharmacy International segment consists primarily of the Alliance Boots pharmacy-led health and beauty stores, optical practices and related contract manufacturing operations. The Pharmaceutical Wholesale segment consists of the Alliance Boots pharmaceutical wholesaling and distribution businesses. The Company's portfolio of retail and business brands includes Walgreens, Duane Reade, Boots and Alliance Healthcare, as well as global health and beauty product brands, including No7, Botanics, Liz Earle and Soap & Glory.", "WDAY": "Workday, Inc. is a provider of enterprise cloud applications for finance and human resources. The Company delivers financial management, human capital management and analytics applications designed for various companies, educational institutions and government agencies. As part of its applications, the Company provides embedded analytics that capture the content and context of everyday business events, facilitating informed decision-making from wherever users are working. Its applications include Workday Financial Management, Workday Human Capital Management (HCM) and Other Applications. It also provides open, standards-based Web-services application programming interfaces, and pre-built packaged integrations and connectors. Workday Financial Management is a unified application with a range of financial capabilities, relevant analytics and metrics, and auditable process management. Workday HCM allows an organization to staff, pay, organize and develop its global workforce.", "WDC": "Western Digital Corporation (Western Digital) is a developer, manufacturer and provider of data storage devices and solutions that address the needs of the information technology (IT) industry and the infrastructure that enables the proliferation of data in virtually every industry. The Company's portfolio of offerings addresses three categories: Datacenter Devices and Solutions (capacity and performance enterprise hard disk drives (HDDs), enterprise solid state drives (SSDs), datacenter software and system solutions); Client Devices (mobile, desktop, gaming and digital video hard drives, client SSDs, embedded products and wafers), and Client Solutions (removable products, hard drive content solutions and flash content solutions). The Company develops and manufactures a portion of the recording heads and magnetic media used in its hard drive products.", "XEL": "Xcel Energy Inc. is a public utility holding company. The Company's operations include the activity of four utility subsidiaries that serve electric and natural gas customers in eight states. The Company's segments include regulated electric utility, regulated natural gas utility and all other. The Company's utility subsidiaries include NSP-Minnesota, NSP-Wisconsin, Public Service Company of Colorado (PSCo) and Southwestern Public Service Co. (SPS), which serve customers in portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas and Wisconsin. Along with WYCO Development LLC (WYCO), a joint venture formed with Colorado Interstate Gas Company, LLC (CIG) to develop and lease natural gas pipelines storage and compression facilities, and WestGas InterState, Inc. (WGI), an interstate natural gas pipeline company, these companies comprise the regulated utility operations.", "XLNX": "Xilinx, Inc. (Xilinx) is engaged in designing and developing programmable devices and associated technologies. The Company's programmable devices and associated technologies include integrated circuits (ICs) in the form of programmable logic devices (PLDs), including programmable System on Chips (SoCs) and three-dimensional ICs (3D ICs); software design tools to program the PLDs; targeted reference designs; printed circuit boards, and intellectual property (IP), which consists of Xilinx, and various third-party verification and IP cores. The Company provides design services, customer training, field engineering and technical support. Its PLDs include field programmable gate arrays (FPGAs), complex programmable logic devices (CPLDs) that its customers program to perform desired logic functions, and programmable SoCs, which combine (Advanced reduced instruction set computing (RISC) Machines (ARM)) processor-based systems with programmable logic in a single device.", "GOOGL": "", "GOOG": ""}